backend/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC
---
  def index
    @todos = Todo.all

INSERT INTO "todos" ("todo_name", "completed", "created_at", "updated_at") VALUES ('test2', 0, '2025-05-22 02:11:59.743946', '2025-05-22 02:11:59.743946') RETURNING "id"
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save

UPDATE "todos" SET "completed" = 1, "updated_at" = '2025-05-22 02:12:17.184923' WHERE "todos"."id" = 2
---
  def update_completed
    if @todo.update(completed: params[:completed])

DELETE FROM "todos" WHERE "todos"."id" = 2
---
  def destroy
    @todo.destroy!

SELECT "todos".* FROM "todos" WHERE "todos"."id" = 2 LIMIT 1
---
    def set_todo
      @todo = Todo.find(params.expect(:id))